АТДЛК/src/Documents/ОплатаПеревозчику/ОплатаПеревозчику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаПеревозчику</name>
  <basedOn>Document.ЗаявкаНаПеревозку</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСПеревозчиками</registerRecords>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидОплаты</types>
    </type>
  </attributes>
</mdclass:Document>

АТДЛК/src/AccumulationRegisters/РасчетыСПеревозчиками/РасчетыСПеревозчиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПеревозчиками</name>
  <resources>
    <name>Сумма</name>
    <comment>Сколько мы должны перевозчику</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПеревозку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АТДЛК/src/Documents/ОплатаПеревозчику/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасчетыСПеревозчиками Расход
	Движения.РасчетыСПеревозчиками.Записывать = Истина;
	Движение = Движения.РасчетыСПеревозчиками.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Перевозчик = Перевозчик;
	Движение.ЗаявкаНаПеревозку = Заявка;
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаПеревозку") Тогда
		// Заполнение шапки
		Заявка = ДанныеЗаполнения.Ссылка;
		Перевозчик = ДанныеЗаполнения.Перевозчик;

	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры
